Repository: ritamonteiro1/pokemon-app
Catalog: lib/l10n/intl_*.arb
Languages: es

# appName
source: ioasys pok√©dex
es: ioasys pokédex

# pokemonListScreenTextFieldLabelTextSearch
source: Search
es: Búsqueda

# pokemonListScreenTextFieldHintTextSearch
source: Search pokemon
es: Búsqueda pokemon

# messageNetworkError
source: Connection fail
es: Conexión fallida

# messageGenericStatusCodeError
source: Occurred error
es: Ocurrio un error

# messageTryAgain
source: Try again
es: Inténtalo de nuev

# messageNotFoundPokemon
source: This pokemon is not here ;(
es: Este pokemon no esta aqui ;(

# favoritePokemonListScreenMyFavoritePokemons
source: My favorites
es: Mis favoritos

# favoritePokemonListScreenBackText
source: Back
es: Regreso

# pokemonDetailsScreenWeightText
source: Weight
es: Peso

# pokemonDetailsScreenHeightText
source: Height
es: Altura

# pokemonDetailsScreenMovesText
source: Moves
es: Movimentos

# pokemonDetailsScreenBaseStatsText
source: Base Stats
es: Estadísticas básicas

# favoritePokemonListScreenEmptyList
source: Empty list. Add your fav pokemons here
es: Lista vacía. agrega tus pokemons favoritos aqui

# pokemonDetailsScreenMessageSnackBarSuccessfullyAddPokemon
source: Pokemon added to favorites list
es: Pokémon agregado a la lista de favoritos

# pokemonDetailsScreenMessageSnackBarSuccessfullyRemovePokemon
source: Pokemon eliminado de la lista de favoritos!
es: Pokémon eliminado de la lista de favoritos!
